app/serializers/user_serializer.rb

SELECT "bakes".* FROM "bakes" WHERE "bakes"."user_id" = $1  [["user_id", 1]]
---
  def bakes
    self.object.bakes.map do |bake|