app/controllers/bakes_controller.rb

    def index
        bakes = Bake.all
---
SELECT "bakes".* FROM "bakes"

    def show
        bake = Bake.find_by(id: params[:id])
---
SELECT "bakes".* FROM "bakes" WHERE "bakes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        bake = Bake.create(bake_params)
---
INSERT INTO "bakes" ("user_id", "total_flour_p", "hydration", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["total_flour_p", 100], ["hydration", 0], ["name", "Huffelpuff"], ["date", "2020/02/01"], ["created_at", "2020-02-04 18:36:43.507928"], ["updated_at", "2020-02-04 18:36:43.507928"]]