app/controllers/notes_controller.rb

    def index
        notes = Note.all
---
SELECT "notes".* FROM "notes"