app/controllers/users_controller.rb

    def create
        user = User.find_by(email: params[:email])
        if (!user)
            user = User.create(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "katrina.reinsdorff@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "katrina.reinsdorff@gmail.com"], ["created_at", "2020-01-31 01:23:04.471385"], ["updated_at", "2020-01-31 01:23:04.471385"]]